performance/artillery.yml
config:
  target: "{{ target_url | 'http://localhost:3001' }}"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  defaults:
    headers:
      Authorization: "Bearer {{ auth_token }}"
      Content-Type: "application/json"

scenarios:
  - name: "Booking Flow"
    flow:
      - post:
          url: "/api/v1/bookings"
          json:
            roomId: "room-001"
            startTime: "2024-12-15T14:00:00Z"
            endTime: "2024-12-15T15:00:00Z"
          capture:
            json: "$.data.id"
            as: "bookingId"
      - get:
          url: "/api/v1/bookings/{{ bookingId }}"
          expect:
            - statusCode: 200

  - name: "Room Discovery"
    flow:
      - get:
          url: "/api/v1/rooms"
          expect:
            - statusCode: 200
            - contentType: json
      - get:
          url: "/api/v1/rooms?capacity=30"
          expect:
            - statusCode: 200